<?php
return [
    /*
    |--------------------------------------------------------------------------
    | 企业ID
    |--------------------------------------------------------------------------
    |
    | 每个企业都拥有唯一的corpid，获取此信息可在管理后台“我的企业”－“企业信息”下查看“企业ID”（需要有管理员权限）。
    |
    */

    'corp_id' => env('WECHATWORK_CORP_ID'),

    /*
    |--------------------------------------------------------------------------
    | 默认应用
    |--------------------------------------------------------------------------
    |
    | 定义默认使用的应用。
    |
    */

    'default' => 'contacts',

    /*
    |--------------------------------------------------------------------------
    | 应用列表
    |--------------------------------------------------------------------------
    |
    | 定义应用列表，如果某个应用的某些配置用不到或者不存在，可以不定义。
    |
    */

    'agents' => [
        'contacts' => [//通讯录
            'secret'   => env('WECHATWORK_AGENTS_CONTACTS_SECRET'),
        ],
        'OA' => [//打卡
            'agent_id' => env('WECHATWORK_AGENTS_OA_AGENT_ID'),
            'secret'   => env('WECHATWORK_AGENTS_OA_SECRET'),
        ],
        'application'=>[//自建应用
            'agent_id' => env('WECHATWORK_AGENTS_APPLICATION_AGENT_ID'),
            'secret'=>env('WECHATWORK_AGENTS_APPLICATION_SECRET')
        ]
    ],
];
